Revit 2026 API

# CurtainSystemRemoveCurtainGrid Method

---

Remove CurtainGrid from the specified face for the CurtainSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCurtainGrid(
	Reference face
)
```
```vb
Public Sub RemoveCurtainGrid (
	face As Reference
)
```
```cpp
public:
void RemoveCurtainGrid(
	Reference^ face
)
```
```fsharp
member RemoveCurtainGrid :
        face : Reference -> unit
```

#### Parameters

face Reference
    The face CurtainGrid will be removed from.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input parameter face is . |
| InvalidOperationException | Thrown when the CurtainGrid cannot be removed from the specified face or regenerate fails. |

#### Reference

CurtainSystem Class

Autodesk.Revit.DB Namespace